glcloud/keil_v5/ARM/PACK/.Web/SiliconLabs.EFR32MG12P_DFP.pdsc
        <!-- *************************  Device 'EFR32MG12P433F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P433F1024GM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P433F1024GM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P433F1024GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P433F1024GM68'  ***************************** -->
        <device Dname="EFR32MG12P433F1024GM68">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P433F1024GM68"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P433F1024GM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P433F1024IL125'  ***************************** -->
        <device Dname="EFR32MG12P433F1024IL125">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P433F1024IL125"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P433F1024IL125.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P433F1024IM48'  ***************************** -->
        <device Dname="EFR32MG12P433F1024IM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P433F1024IM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P433F1024IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFR32MG12P">
      <description>Silicon Labs EFR32MG12P device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32MG12P*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="5.7.0" condition="EFR32MG12P">
      <description>System Startup for Silicon Labs EFR32MG12P device series</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/SiliconLabs/EFR32MG12P/Include/"/>
        <file category="header"  name="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"/>
        <!-- startup files -->
        <file category="source"  name="Device/SiliconLabs/EFR32MG12P/Source/ARM/startup_efr32mg12p.s" condition="Compiler ARMCC" attr="config" version="5.7.0"/>
        <file category="source"  name="Device/SiliconLabs/EFR32MG12P/Source/GCC/startup_efr32mg12p.S" condition="Compiler GCC"   attr="config" version="5.7.0"/>
        <!-- linker command file -->
        <file category="linkerScript"  name="Device/SiliconLabs/EFR32MG12P/Source/GCC/efr32mg12p.ld" condition="Compiler GCC" attr="config" version="5.7.0"/>
        <!-- system file -->
        <file category="source"  name="Device/SiliconLabs/EFR32MG12P/Source/system_efr32mg12p.c" attr="config" version="5.7.0"/>
      </files>
    </component>
  </components>
</package>
